InterstitialTech/automato-arduino/src/boards.txt
# Automato Boards Definition

menu.UploadSpeed=Upload Speed
menu.CDCOnBoot=USB CDC On Boot
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter
menu.ZigbeeMode=Zigbee Mode

##############################################################

automato_brain.name=Automato Brain Board
# based on the SparkFun ESP32-C6 Qwiic Pocket from ESP32 Arduino

automato_brain.bootloader.tool=esptool_py
automato_brain.bootloader.tool.default=esptool_py

automato_brain.upload.tool=esptool_py
automato_brain.upload.tool.default=esptool_py
automato_brain.upload.tool.network=esp_ota

automato_brain.upload.maximum_size=1310720
automato_brain.upload.maximum_data_size=327680
automato_brain.upload.flags=
automato_brain.upload.extra_flags=
automato_brain.upload.use_1200bps_touch=false
automato_brain.upload.wait_for_upload_port=false

automato_brain.serial.disableDTR=false
automato_brain.serial.disableRTS=false

automato_brain.build.tarch=riscv32
automato_brain.build.target=esp
automato_brain.build.mcu=esp32c6
automato_brain.build.core=esp32
automato_brain.build.variant=automato_brain
automato_brain.build.board=AUTOMATO_BRAIN
automato_brain.build.bootloader_addr=0x0

automato_brain.build.cdc_on_boot=0
automato_brain.build.f_cpu=160000000L
automato_brain.build.flash_size=4MB
automato_brain.build.flash_freq=80m
automato_brain.build.flash_mode=qio
automato_brain.build.boot=qio
automato_brain.build.partitions=default
automato_brain.build.defines=

## IDE 2.0 Seems to not update the value
automato_brain.menu.JTAGAdapter.default=Disabled
automato_brain.menu.JTAGAdapter.default.build.copy_jtag_files=0
automato_brain.menu.JTAGAdapter.builtin=Integrated USB JTAG
automato_brain.menu.JTAGAdapter.builtin.build.openocdscript=esp32c6-builtin.cfg
automato_brain.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
automato_brain.menu.JTAGAdapter.external=FTDI Adapter
automato_brain.menu.JTAGAdapter.external.build.openocdscript=esp32c6-ftdi.cfg
automato_brain.menu.JTAGAdapter.external.build.copy_jtag_files=1
automato_brain.menu.JTAGAdapter.bridge=ESP USB Bridge
automato_brain.menu.JTAGAdapter.bridge.build.openocdscript=esp32c6-bridge.cfg
automato_brain.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

automato_brain.menu.CDCOnBoot.default=Enabled
automato_brain.menu.CDCOnBoot.default.build.cdc_on_boot=1
automato_brain.menu.CDCOnBoot.cdc=Disabled
automato_brain.menu.CDCOnBoot.cdc.build.cdc_on_boot=0

automato_brain.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
automato_brain.menu.PartitionScheme.default.build.partitions=default
automato_brain.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
automato_brain.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
automato_brain.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
automato_brain.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
automato_brain.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
automato_brain.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
automato_brain.menu.PartitionScheme.minimal.build.partitions=minimal
automato_brain.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
automato_brain.menu.PartitionScheme.no_ota.build.partitions=no_ota
automato_brain.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
automato_brain.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
automato_brain.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
automato_brain.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
automato_brain.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
automato_brain.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
automato_brain.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
automato_brain.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
automato_brain.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
automato_brain.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
automato_brain.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
automato_brain.menu.PartitionScheme.huge_app.build.partitions=huge_app
automato_brain.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
automato_brain.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
automato_brain.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
automato_brain.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
automato_brain.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
automato_brain.menu.PartitionScheme.fatflash.build.partitions=ffat
automato_brain.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
automato_brain.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
automato_brain.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
automato_brain.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
automato_brain.menu.PartitionScheme.rainmaker=RainMaker 4MB
automato_brain.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
automato_brain.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
automato_brain.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
automato_brain.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
automato_brain.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
automato_brain.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
automato_brain.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
automato_brain.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000
automato_brain.menu.PartitionScheme.zigbee=Zigbee 4MB with spiffs
automato_brain.menu.PartitionScheme.zigbee.build.partitions=zigbee
automato_brain.menu.PartitionScheme.zigbee.upload.maximum_size=1310720
automato_brain.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
automato_brain.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
automato_brain.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
automato_brain.menu.PartitionScheme.custom=Custom
automato_brain.menu.PartitionScheme.custom.build.partitions=
automato_brain.menu.PartitionScheme.custom.upload.maximum_size=16777216

automato_brain.menu.CPUFreq.160=160MHz (WiFi)
automato_brain.menu.CPUFreq.160.build.f_cpu=160000000L
automato_brain.menu.CPUFreq.80=80MHz (WiFi)
automato_brain.menu.CPUFreq.80.build.f_cpu=80000000L
automato_brain.menu.CPUFreq.40=40MHz
automato_brain.menu.CPUFreq.40.build.f_cpu=40000000L
automato_brain.menu.CPUFreq.20=20MHz
automato_brain.menu.CPUFreq.20.build.f_cpu=20000000L
automato_brain.menu.CPUFreq.10=10MHz
automato_brain.menu.CPUFreq.10.build.f_cpu=10000000L

automato_brain.menu.FlashMode.qio=QIO
automato_brain.menu.FlashMode.qio.build.flash_mode=dio
automato_brain.menu.FlashMode.qio.build.boot=qio
automato_brain.menu.FlashMode.dio=DIO
automato_brain.menu.FlashMode.dio.build.flash_mode=dio
automato_brain.menu.FlashMode.dio.build.boot=dio

automato_brain.menu.FlashFreq.80=80MHz
automato_brain.menu.FlashFreq.80.build.flash_freq=80m
automato_brain.menu.FlashFreq.40=40MHz
automato_brain.menu.FlashFreq.40.build.flash_freq=40m

automato_brain.menu.FlashSize.4M=4MB (32Mb)
automato_brain.menu.FlashSize.4M.build.flash_size=4MB
automato_brain.menu.FlashSize.8M=8MB (64Mb)
automato_brain.menu.FlashSize.8M.build.flash_size=8MB
automato_brain.menu.FlashSize.2M=2MB (16Mb)
automato_brain.menu.FlashSize.2M.build.flash_size=2MB
automato_brain.menu.FlashSize.16M=16MB (128Mb)
automato_brain.menu.FlashSize.16M.build.flash_size=16MB

automato_brain.menu.UploadSpeed.921600=921600
automato_brain.menu.UploadSpeed.921600.upload.speed=921600
automato_brain.menu.UploadSpeed.115200=115200
automato_brain.menu.UploadSpeed.115200.upload.speed=115200
automato_brain.menu.UploadSpeed.256000.windows=256000
automato_brain.menu.UploadSpeed.256000.upload.speed=256000
automato_brain.menu.UploadSpeed.230400.windows.upload.speed=256000
automato_brain.menu.UploadSpeed.230400=230400
automato_brain.menu.UploadSpeed.230400.upload.speed=230400
automato_brain.menu.UploadSpeed.460800.linux=460800
automato_brain.menu.UploadSpeed.460800.macosx=460800
automato_brain.menu.UploadSpeed.460800.upload.speed=460800
automato_brain.menu.UploadSpeed.512000.windows=512000
automato_brain.menu.UploadSpeed.512000.upload.speed=512000

automato_brain.menu.DebugLevel.none=None
automato_brain.menu.DebugLevel.none.build.code_debug=0
automato_brain.menu.DebugLevel.error=Error
automato_brain.menu.DebugLevel.error.build.code_debug=1
automato_brain.menu.DebugLevel.warn=Warn
automato_brain.menu.DebugLevel.warn.build.code_debug=2
automato_brain.menu.DebugLevel.info=Info
automato_brain.menu.DebugLevel.info.build.code_debug=3
automato_brain.menu.DebugLevel.debug=Debug
automato_brain.menu.DebugLevel.debug.build.code_debug=4
automato_brain.menu.DebugLevel.verbose=Verbose
automato_brain.menu.DebugLevel.verbose.build.code_debug=5

automato_brain.menu.EraseFlash.none=Disabled
automato_brain.menu.EraseFlash.none.upload.erase_cmd=
automato_brain.menu.EraseFlash.all=Enabled
automato_brain.menu.EraseFlash.all.upload.erase_cmd=-e

automato_brain.menu.ZigbeeMode.default=Disabled
automato_brain.menu.ZigbeeMode.default.build.zigbee_mode=
automato_brain.menu.ZigbeeMode.default.build.zigbee_libs=
automato_brain.menu.ZigbeeMode.ed=Zigbee ED (end device)
automato_brain.menu.ZigbeeMode.ed.build.zigbee_mode=-DZIGBEE_MODE_ED
automato_brain.menu.ZigbeeMode.ed.build.zigbee_libs=-lesp_zb_api.ed -lzboss_stack.ed -lzboss_port.native
automato_brain.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
automato_brain.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
automato_brain.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.native

